// ============================================================
// 🐌 УЛИТКА
// Узлы внутреннего дерева программы
// ============================================================


// ============================================================
// ОБЩИЙ ТИП ЛЮБОГО УЗЛА
// ============================================================

export type Узел =

    | Программа
    | Блок
    | ОбъявлениеПеременной
    | Число
    | Текст
    | Имя
    | Операция
    | ВызовФункции
    | Функция
    | Возврат;


// ============================================================
// ПРОГРАММА
// ============================================================

export interface Программа {

    вид: "ПРОГРАММА";

    имя: string;

    тело: Блок;
}


// ============================================================
// БЛОК КОМАНД
// ============================================================

export interface Блок {

    вид: "БЛОК";

    команды: Узел[];
}


// ============================================================
// ОБЪЯВЛЕНИЕ ПЕРЕМЕННОЙ
// ============================================================

export interface ОбъявлениеПеременной {

    вид: "ОБЪЯВЛЕНИЕ_ПЕРЕМЕННОЙ";

    имя: string;

    значение: Узел;
}


// ============================================================
// ЧИСЛО
// ============================================================

export interface Число {

    вид: "ЧИСЛО";

    значение: number;
}


// ============================================================
// ТЕКСТ
// ============================================================

export interface Текст {

    вид: "ТЕКСТ";

    значение: string;
}


// ============================================================
// ИМЯ ПЕРЕМЕННОЙ
// ============================================================

export interface Имя {

    вид: "ИМЯ";

    значение: string;
}


// ============================================================
// АРИФМЕТИЧЕСКАЯ ИЛИ ЛОГИЧЕСКАЯ ОПЕРАЦИЯ
// ============================================================

export interface Операция {

    вид: "ОПЕРАЦИЯ";

    оператор: string;

    левое: Узел;

    правое: Узел;
}


// ============================================================
// ВЫЗОВ ФУНКЦИИ
// ============================================================

export interface ВызовФункции {

    вид: "ВЫЗОВ_ФУНКЦИИ";

    имя: string;

    аргументы: Узел[];
}


// ============================================================
// ФУНКЦИЯ
// ============================================================

export interface Функция {

    вид: "ФУНКЦИЯ";

    имя: string;

    параметры: string[];

    тело: Блок;
}


// ============================================================
// ВОЗВРАТ ЗНАЧЕНИЯ
// ============================================================

export interface Возврат {

    вид: "ВОЗВРАТ";

    значение: Узел;
}
