"use strict";
/**
 * ============================================================
 * 🐌 УЛИТКА
 * Безопасные реальные команды Git
 * Этап 3.5.3
 * ============================================================
 */
Object.defineProperty(exports, "__esModule", { value: true });
exports.получитьСостояниеGit = получитьСостояниеGit;
exports.получитьИзмененияGit = получитьИзмененияGit;
exports.получитьИсториюGit = получитьИсториюGit;
const _______________________git_js_1 = require("./\u0438\u0441\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C_git.js");
function получитьСостояниеGit() {
    return (0, _______________________git_js_1.выполнитьGit)({
        команда: "status",
        аргументы: ["--short", "--branch"],
    });
}
function получитьИзмененияGit() {
    return (0, _______________________git_js_1.выполнитьGit)({
        команда: "diff",
    });
}
function получитьИсториюGit() {
    return (0, _______________________git_js_1.выполнитьGit)({
        команда: "log",
        аргументы: ["-5", "--oneline"],
    });
}
